Revit 2024 API
IFCData.HasSimpleType Method
 Determines if there is one corresponding IFC type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool HasSimpleType()
Visual Basic
Public Function HasSimpleType As Boolean
Visual C++
public:
bool HasSimpleType()
Return Value
 False if there are no corresponding IFC types, or more than one; returns true otherwise.
See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace